/**
 * 전화 정규식
 */
export const phoneRegExp = /^\d{2,3}-\d{3,4}-\d{4}$/

/**
 * 숫자 정규식
 */
export const NUMBER_REG_EXP = /^\d+$/

/**
 * 휴대폰 정규식 반환
 */
export const MOBILE_REG_EXP = /^((010-\d{4})|(01[16789]-\d{3,4}))(-\d{4})$/

/**
 * 비밀번호 숫자/영문 특수문자 포함 8~20자리 정규식 반환
 */
export const PASSWORD_REG_EXP = /^(?=.*[₩\\{\\}\\[\]\\/?.,;:|\\)*~`!^\-_+<>@\\#$%&\\\\=\\(\\'\\"])(?!.*\s)(?=.*\d)(?=.*[a-zA-Z]).{8,20}$/

/**
 * 유효한 이메일 정규식 반환
 */
export const EMAIL_REG_EXP = /^([\w-]+(?:\.[\w-]+)*)@((?:[\w-]+\.)*\w[\w-]{0,66})\.([a-z]{2,6}(?:\.[a-z]{2})?)$/
